INSERT INTO contents (content, post_id)
  VALUES ('Брокерская компания южнокорейской корпорации Samsung случайно раздала сотрудникам акции на 105 миллиардов долларов, передает агентство Bloomberg.
Компания планировала выплатить дивиденды сотрудникам, владеющим акциями, по тысяче вон (около 0,94 доллара) за бумагу.
Из-за ошибки одного из работников Samsung Securities акционерам передали 2,8 миллиарда бумаг, стоимость которых теоретически составила 112,6 триллиона вон (около 105 миллиардов долларов). Эта цифра примерно в 30 раз превышает рыночную стоимость Samsung Securities. Через несколько минут после получения акций 16 сотрудников успели продать около 5 миллионов ценных бумаг на сумму свыше 185 миллионов долларов. Это привело к падению акций Samsung на 12 процентов в течение нескольких минут 6 апреля.
Южнокорейский финансовый регулятор начал проверку в отношении Samsung Securities. Виновник ошибки и сотрудники, продавшие акции, отстранены от работы.
Bloomberg называет этот инцидент одним из крупнейших случаев так называемого эффекта «толстого пальца», когда трейдер случайно нажимает не на ту кнопку.', 1);

INSERT INTO contents (content, post_id)
  VALUES ('152364476215868811.jpg', 1);

INSERT INTO contents (content, post_id)
  VALUES ('152364457018161326.jpg', 1);

INSERT INTO contents (content, post_id)
  VALUES ('Пользователь Reddit с ником elliotttate рассказал, как сделал из версии Skyrim для виртуальной реальности своего рода тренажёр для упражнений.
Он понемногу давал себе физические нагрузки и в других VR-играх, однако «полноценные тренировки», по его словам, начались после выхода RPG от Bethesda для гарнитур, совместимых с ПК.
Чтобы усилить «эффект погружения» в игру, реддитор поставил несколько модов и установил для себя определённые правила «отыгрыша» Драконорождённого. К примеру, как можно больше двигаться в бою: уклоняться от стрел и ударов мечом, а также прятаться за укрытиями.', 2);

INSERT INTO contents (content, post_id)
  VALUES ('1523811989136864191.jpg', 2);

INSERT INTO contents (content, post_id)
  VALUES ('1523817407121355933.jpg', 2);

INSERT INTO contents (content, post_id)
  VALUES ('Годом позже канадский стартап Lyrebird запустил бета-версию сервиса (легко гуглится), с помощью которого можно обучить нейронную сеть имитировать любой голос. Для обучения необходима запись длиной уже всего одна! минута.
В своем бложике они всячески подчёркивают свои исключительно добрые намерения, бьют себя в грудь, обещая, что "ваш голос принадлежит только вам", а они "всего лишь обслуга". Но это все слова, тем более я не нашел ни одного упоминания о хотя бы предположительной области применения этой технологии.
И теперь перейдем к самому интересному.
Учёные из китайской компании Baidu в феврале 2018 опубликовали статью, в которой описывается подход к клонированию голоса, работающий на образцах длиной всего 3.7 секунды!!!! Качество результата в таком случае, конечно плохое, но разработка-то продолжается...
Так что, уважаемые пикабушники, хочу предупредить вас, что уже совсем скоро телефонные мошенники смогут выйти на новый уровень. И теперь вместо смски от "сына/дочери/внука/.." с просьбой срочно положить денег на телефон, они просто позвонят. И для генерации вашего голоса используют запись вашего разговора с какой-нибудь службой поддержки, "случайно" пропавшей в открытый доступ. Будьте осторожны!', 3);

INSERT INTO contents (content, post_id)
  VALUES ('1523514213144882170.jpg', 3);

